{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bee&#x27;s Blog",
    "description": "",
    "home_page_url": "https://bumblebee.city/blog",
    "feed_url": "https://bumblebee.city/blog/feed.json",
    "user_comment": "",
    "icon": "https://bumblebee.city/blog/media/website/blogLogo.png",
    "author": {
        "name": "Bee"
    },
    "items": [
        {
            "id": "https://bumblebee.city/blog/the-trees-of-my-childhood-are-gone.html",
            "url": "https://bumblebee.city/blog/the-trees-of-my-childhood-are-gone.html",
            "title": "The Trees of my Childhood are Gone.",
            "summary": "There's not a lot I like about this town these days, but as a kid, I didn't mind it. The proximity to the great outdoors is always a bonus when you're a rambunctious ADHD-riddled child with equally rambunctious friends. The forests are different now, though.",
            "content_html": "<p>There's not a lot I like about this town these days, but as a kid, I didn't mind it. The proximity to the great outdoors is always a bonus when you're a rambunctious ADHD-riddled child with equally rambunctious friends. </p>\n<p>The forests are different now, though. They never stayed the same. A lot changes over the quarter of a century.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611027921272882/20241006_150726.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=c0d3613e0a99fd14a2e9bfd873bf0a9c25a0ba0ee49e889b3a3b34392bf344aa&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611027921272882/20241006_150726.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=c0d3613e0a99fd14a2e9bfd873bf0a9c25a0ba0ee49e889b3a3b34392bf344aa&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This stump was once a tree in my parents' back yard. It had wooden boards nailed to it forming a ladder that became increasingly dangerous over the years, and a tire swing once hung from a large branch. I would climb this tree all the time well into my teens. It grew too big, though. It was too close to some power lines, and it became a hazard. The city had to come and cut the tree down a few years ago. The yard feels a lot smaller now.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029930606613/20241006_141050.jpg?ex=67045d55&amp;is=67030bd5&amp;hm=e38d64a1461fb5a19d4d2a4982f5d0cf53183a86f39db780897c35bc3061ca5d&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029930606613/20241006_141050.jpg?ex=67045d55&amp;is=67030bd5&amp;hm=e38d64a1461fb5a19d4d2a4982f5d0cf53183a86f39db780897c35bc3061ca5d&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This is a park near my house. This patch of trees is only about 60 feet wide, maybe less, but a decade ago it was dense enough that the term \"forest\" still felt applicable. I would play in this forest with my siblings as a kid sometimes, or would often just walk the path that cuts through the middle. To the left, there's a spot where a tree once stood. There's no way now to know where it was if you'd never seen it. The spot is just dirt and various plants now. </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/14/treeeee.png\" alt=\"\" width=\"363\" height=\"455\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/14/responsive/treeeee-xs.png 640w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-sm.png 768w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-md.png 1024w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-lg.png 1366w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-xl.png 1600w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-2xl.png 1920w\"></figure>\n<p>This log used to be the tree in question. There's still one final rung of a ladder once nailed to wood long ago. I have absolutely no idea who build the ladder or how long ago it was. As long as I could remember, most of the footholds were gone, with the rest far out of reach, no proper way to climb to the top.</p>\n<p>Today I finally touched the \"top\" of this tree after it was far out of my reach for so long. I didn't know how to feel about it.</p>\n<p>There's another forest at the edge of the playground of the elementary school I went to. It's probably only 20 feet from the edge of the field to the back fence. Kids weren't allowed in it, but we found ways, obviously. At winter, large snow forts would be constructed at the edge of the trees, with paths trailing into the trees hidden away from the teachers. When school wasn't in session, the forest would be explored less secretively, with no teachers around to tell us not to. There was a tiny murky pond in the forest that, in the first grade, I tried starting a rumour was inhabited with all sorts of terrible giant fish monsters despite how miniscule the body of water was. The \"Swamp of Doom,\" as I so creatively called it, has since been filled in. No monsters could possibly live there now.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029376831550/20241006_141954.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=186c74090d1eb7632997e62152b42e09e95c80bd34a2d531a04bee84682c3215&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029376831550/20241006_141954.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=186c74090d1eb7632997e62152b42e09e95c80bd34a2d531a04bee84682c3215&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This clearing in the school forest was... well it was always a clearing of <em>some </em>scale, but it used to be a bit more secluded, and far smaller. There was a tree near the middle of this shot, with smaller trees circling around, forming a hidden little area. My best friend and I used to hang out in there when we were 12. It was a special secret spot him and I claimed as ours (though based on the number of chip bags and pop bottles that were occasionally already there, I imagine countless groups of kids had the same idea). I had my first kiss here, with him. As the forest thinned, the clearing is no longer even remotely tucked away. This clearing couldn't possibly be a place where a boy who hasn't yet realized he's not a boy could hide away and discoverer that kissing other boys isn't so bad.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028844019783/20241006_142229.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=389d5125a5305991074fde1d982fb41969d041e7253b1f8594ddd6d59394bf0c&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028844019783/20241006_142229.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=389d5125a5305991074fde1d982fb41969d041e7253b1f8594ddd6d59394bf0c&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This was once a massive field with a sparse forest along one side. There was a massive dirt trail leading downhill that my older sibling and I used to go biking down all the time as kids. We used to call the trail the Test Track for some unknown reason. Nothing was being tested there and it certainly wasn't much of a <em>track</em>. But it was the Test Track. Now it's all houses and apartment buildings and even what's probably the largest elementary school in the whole town. It was all torn down long enough ago that I only have vague impressions in my mind of what the Test Track used to look like. It's almost hard to imagine it was even there at all.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028428918844/20241006_144205.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=22dbe3c7bc992315f247e6feb59d1ec88a74a3fabb59dfe083e16e5ced318abe&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028428918844/20241006_144205.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=22dbe3c7bc992315f247e6feb59d1ec88a74a3fabb59dfe083e16e5ced318abe&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This paved path is another place we would bike. Years ago, the path was just through a forest. Much like the Test Track, there was a rapid period of houses being built here. One side is still forest, with the train tracks trailing just past the trees. The other side of the path is a slightly uncomfortable feeling view into a bunch of strangers' back yards, or even right into their house through big sliding glass doors. It manages to be both quieter and louder than it used to be at the same time. Less leaves rustling in the wind, or birds chirping, or unknown small animals sneaking through the bushes. It's a lot more empty sounding, aside from the sounds of trucks going by or people having conversations with the windows open or laughing in their back yards. Don't get me wrong, most of these new sounds certainly aren't bad. I really like hearing people obviously having fun. It's just different. It isn't what it once was.</p>\n<p>Some of these changes are due to land development. Most of them are just due to time. The trees I grew up with are gone. They were there, they were a part of my childhood, and they were alive. These old, towering organisms enriched my life with no way to possibly be aware of it. Now they're dead. </p>\n<p>Everything changes. Nothing stays the same. Everything around you is different from how it was last week. By the time you notice it, though, what you once knew is gone.</p>\n<p>We lose everything eventually. Even trees.</p>\n<p>Take some time to focus on and appreciate what's here right now.</p>",
            "author": {
                "name": "Bee"
            },
            "tags": [
            ],
            "date_published": "2024-10-06T16:52:00-07:00",
            "date_modified": "2024-10-06T16:55:34-07:00"
        },
        {
            "id": "https://bumblebee.city/blog/eggbugs-obituary-goodbye-cohost.html",
            "url": "https://bumblebee.city/blog/eggbugs-obituary-goodbye-cohost.html",
            "title": "Eggbug’s Obituary: Goodbye, Cohost",
            "summary": "As most people reading this probably know, on October 1st, Cohost is shutting down. This website meant a lot to me, as it did for a lot of people. I need to write about it and get my thoughts out. I won’t lie, I spent&hellip;",
            "content_html": "<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/3/eggbug.png\" alt=\"\" width=\"440\" height=\"440\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/3/responsive/eggbug-xs.png 640w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-sm.png 768w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-md.png 1024w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-lg.png 1366w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-xl.png 1600w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-2xl.png 1920w\"></figure>\n<p><span style=\"font-weight: 400;\">As most people reading this probably know, on October 1st, Cohost is shutting down. This website meant a lot to me, as it did for a lot of people. I need to write about it and get my thoughts out.</span></p>\n<p><span style=\"font-weight: 400;\">I won’t lie, I spent a good portion of last night sitting in bed crying. Being an artist on the internet is hard, and it keeps getting harder every month. Doubly so if you’re like me and made the bad choice of trying to make a living off of it. Cohost felt like a bit of a reprieve from that. It was an incredibly special community.</span></p>\n<p><span style=\"font-weight: 400;\">As I <a href=\"https://bumblebee.city/blog/the-heros-journey-or-how-going-to-a-furry-convention-fixed-my-brain.html\" target=\"_blank\" rel=\"noopener noreferrer\">wrote before</a>, I’ve been struggling with trying to be less scared of what other people think of me. I’ve been trying to allow myself to be more messy, more visibly queer, more open to being whatever I am. Cohost played a big role in that. It helped me realize I HATED the way I was presenting myself online. Being clean and professional and perfect is so boring. I don’t want to limit my online presence to just being an indie game developer. It’s a big part of who I am, but not the only part. I don’t want to be just one thing. Cohost was a space where I could talk about random things like furry conventions or my favourite games or post a bunch of weird pictures of chevrotains. I didn’t feel the need to uphold some reputation. I could just hang out in a way I didn’t feel comfortable doing on sites like Twitter.</span></p>\n<p><span style=\"font-weight: 400;\">The engagement that came from the site is incredible too. I had a modest amount of engagement on Cohost despite not having much interesting to post - the most interesting thing I’ve been working on over the past year is a game that’s too early to announce. I was so excited to finally have something cool and fun to share by the end of the year, and I’m gutted by the fact that there’s not enough time left in the site for me to share this game with the wonderful community Cohost has. I loved the site, but never got the chance to use it to the fullest. But even still, people seemed SIGNIFICANTLY more interested in anything I had to post there than anywhere else. I posted about me going to the Vancouver Game Garden last month all over Twitter, and one person from my modest following on Twitter showed up to play my demo. 3 people who weren’t even following me on Cohost showed up, and then two more showed up because they saw a post made by one of those first 3 recommending people stop by to play my demo specifically. People <em>love </em>things on Cohost in a way no other social media today has. It fills me with dread knowing I’m going to be going back to sites where most people following me really don’t care all that much about my work.</span></p>\n<p><span style=\"font-weight: 400;\">Still, I have hope a website like Cohost will appear again. Maybe it’s foolish to think that, and maybe people will feel too burned from the death of Cohost to want to use it. But I’ve never seen such an emotional, earnest, and deeply mournful response to the loss of a website before in my life. Cohost was needed by so many people. I believe the Cohost staff aren’t the only ones capable of making such a site. </span></p>\n<p><span style=\"font-weight: 400;\">Cohost showed the path to a better internet. Comment more. Curate your social media feeds more deeply. Step away from websites whenever you want. Engage with your communities. My relationship with social media has improved vastly. I’m not going to have as much fun on Twitter or Bluesky as I did on Cohost, and I think that just means I’m going to use them less. If I see something on Twitter that pisses me off, I’ll simply close the website for the day. I’ve seen many people post that Cohost has led them to do the same. The impact Cohost had on those who loved it is deep and positive and will last for a very long time.</span></p>\n<p><span style=\"font-weight: 400;\">A better internet is possible. </span></p>\n<p><span style=\"font-weight: 400;\">Thank you all for the amazing times.</span></p>\n<p><span style=\"font-weight: 400;\">Goodnight, eggbug. One day we will meet again.</span></p>",
            "author": {
                "name": "Bee"
            },
            "tags": [
            ],
            "date_published": "2024-09-10T21:40:42-07:00",
            "date_modified": "2024-09-30T14:38:12-07:00"
        },
        {
            "id": "https://bumblebee.city/blog/the-heros-journey-or-how-going-to-a-furry-convention-fixed-my-brain.html",
            "url": "https://bumblebee.city/blog/the-heros-journey-or-how-going-to-a-furry-convention-fixed-my-brain.html",
            "title": "The Hero’s Journey, or: How Going to a Furry Convention Fixed My Brain",
            "summary": "I’m not entirely sure how long I’ve been this way, but recently I’ve realized I’m someone who is way too scared of what other people think of me, including strangers. This is not an ideal trait to have when you’re someone who’s visibly queer, nor&hellip;",
            "content_html": "<div class=\"co-prose prose my-4 overflow-hidden break-words px-3\">\n<p>I’m not entirely sure how long I’ve been this way, but recently I’ve realized I’m someone who is way too scared of what other people think of me, including strangers. This is not an ideal trait to have when you’re someone who’s visibly queer, nor is it an ideal trait to have when you’re someone who puts very personal art out onto the internet for a living! This year, I’ve been trying to focus on getting better at not worrying about this and just exist. Easier said than done, of course.</p>\n<p>Back in January, thanks to encouragement from my friend Strade (if you’re reading this hii), I made a fursona! I got a lot more invested in it than I expected I would, and spent several hours designing them. I even almost forgot eat that night because I was so focused. If you haven’t seen them yet, here they are!</p>\n<p><img loading=\"lazy\" src=\"http://bumblebee.city/fennel.png\" data-is-external-image=\"true\"></p>\n<p>Their name is Fennel and they’re a dog/sheep combo. It was a really fun form of self expression! Of course, having a fursona didn’t make me a furry or anything. It was just for fun. Of course.</p>\n<p>And then two days later I registered for Vancoufur, a local furry convention.</p>\n<p>In the coming weeks, I grew more and more excited. I’ve been really struggling to make friends and meet people ever since I moved here a year ago, and I was hoping this would be a good chance to socialize with other terminally online queer weirdos.</p>\n<p>Once I got there, it took a while for it to really click for me. I’m not exactly new to cons - I’ve been to the Calgary Fan Expo twice, the Vancouver Fan Expo once, and PAX West twice. Vancoufur was nothing like these. There weren’t a lot of booths, and there weren’t really that many panels going on at a time either. What was I supposed to do between events? Just sit around doing nothing? Don’t get me wrong, I was already having a lot of fun, but I wasn’t really sure why the con lasted for so long if there were so few booths and so few events.</p>\n<p>On the second evening, I was bored and it was several hours until my next panel, so I wandered around and ended up in a big dance/rave area. Dances aren’t really my thing, but I figured it’d be something different to at least look at. Swaying back and forth awkwardly at the back of the room like I did at every dance in high school, I watched all these people dancing and having fun. People wearing fursuits, or cosplays, or maid dresses, or even just regular casual clothes, just dancing and enjoying being themselves. That’s when it hit me, what separated this from any other con I had been to. Standard cons are a bunch of booths and panels surrounding a shared interest. Furry cons are high energy, wholehearted celebrations of being a complete fucking weirdo, and I am so fucking on board with that.</p>\n<p>After that point, I enjoyed the convention a lot more. I allowed myself to go all in and be weird and earnest and cringe! I talked to a lot of people! I joined the annoying chorus of YIPPIEs that would sprout up in the crowd every other hour! I tried on this big waggy tail thing at the Dealer’s Den! It was a lot of fun! Turns out being yourself and allowing yourself to have fun is… well, fun. Who knew! I never realized how much I needed something like this.</p>\n<p>By the time the convention was over, I was exhausted and ready to sleep for a hundred years, but I knew I was fundamentally changed. I’m not the same person I was a week ago. I can already feel in my brain that the little evil leech that’s constantly screeching about how other people think I’m weird has started shrivelling up. It has no more food now that my response to “<i>other people think you’re fucking weird</i>” is usually an indifferent shrug. My anxiety hasn’t disappeared over night, of course, but it’s made an almost supernatural amount of progress over the course of a single weekend.</p>\n<p>Over the past week, I’ve cared a lot less about whether strangers care about my pastel pink dyed hair or the fact that I’m wearing a skirt but have a clearly visible beard shadow. I’ve found myself ever so slightly dancing along a little bit to the music playing on the grocery store radio. I’ve felt a lot more free, and I’m having more little moments of fun in day to day life. It’s been less than a week since the con ended, and I hope this energy continues throughout the year and into the future.</p>\n<p>I have already registered for next year’s con and will probably be going to another, smaller one in November. Yippie!</p>\n<p> </p>\n<img loading=\"lazy\" src=\"http://bumblebee.city/herosjourney.png\" data-is-external-image=\"true\"></div>",
            "author": {
                "name": "Bee"
            },
            "tags": [
                   "life stuff",
                   "furry"
            ],
            "date_published": "2024-03-20T15:54:00-07:00",
            "date_modified": "2024-09-19T01:58:18-07:00"
        }
    ]
}
