{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bee&#x27;s Blog",
    "description": "",
    "home_page_url": "https://bumblebee.city/blog",
    "feed_url": "https://bumblebee.city/blog/feed.json",
    "user_comment": "",
    "icon": "https://bumblebee.city/blog/media/website/blogLogo.png",
    "author": {
        "name": "Bee"
    },
    "items": [
        {
            "id": "https://bumblebee.city/blog/burnout-and-creation.html",
            "url": "https://bumblebee.city/blog/burnout-and-creation.html",
            "title": "working with burnout",
            "summary": "If you aren't following me on social media, you might have missed my little burnout announcement a couple months ago. To summarize... gamedev as a job was starting to crush my soul. I tried making it a job so I could spend as much time&hellip;",
            "content_html": "<p>If you aren't following me on social media, you might have missed my little burnout announcement a couple months ago. To summarize... gamedev as a job was starting to crush my soul. I tried making it a job so I could spend as much time as I wanted making whatever I wanted, but that stopped being the case pretty quickly. </p>\n<p>There was a point where I was working on and off on 3 different games at once. I wanted to try to get out some smaller games to make money alongside my larger, more \"important\" projects. Working on them all at the same time was really exhausting and stressful, and having money as a primary motivator was kind of miserable. I figured if I kept pushing like this, eventually it would all pay off in the end. </p>\n<p>Then, a couple months ago, there was good news about Silksong, a game I've been excited about for years! This should have been a good thing, but the new game I'm working on is a metroidvania. If what is potentially the most highly anticipated metroidvania of all time released too close to my demo, I'd completely lose any marketing reach I could get from that. If Silksong's out, nobody's gonna pay attention to the tiny little metroidvania nobody's ever heard of. I panicked, chugged an energy drink, and worked for 12 hours straight. That's not what making art is supposed to feel like. That's not why I got into this.</p>\n<p>I wasn't spending as much time making whatever I wanted. I was spending as much time as I felt I <em>had </em>to. </p>\n<p>Between everything that happened last year and pushing myself harder than I ever should have, my brain was being ground into dust.</p>\n<p>The past couple months have been weird. Work has been slow, but I still tinker with my games a fair amount. But I'm making sure I take more breaks, have a better work life balance, and stepping away as soon as I start feeling scared about marketing. I think games are going to stop being my primary source of income, at least for now. I'll probably reevaluate things later down the line.</p>\n<p>I hit a pretty low point mentally and emotionally at the end of April, to the point that I decided to start therapy. It's been good, I'm starting to feel better about my work and less hopeless about my current circumstances. I still don't know how I'm going to make everything work, but I shouldn't let that stop me from trying. After all, I'd never written a single line of code before starting Frogsong. I am not someone with a background that would make me qualified to port a game to Nintendo Switch. I'm <em>constantly </em>figuring out how to solve problems I don't even know where to begin with. </p>\n<p>I'm still probably gonna be picking up pieces for a while. But I think I'll be okay.</p>",
            "author": {
                "name": "Bee"
            },
            "tags": [
            ],
            "date_published": "2025-06-27T22:10:00-07:00",
            "date_modified": "2025-06-27T22:10:00-07:00"
        },
        {
            "id": "https://bumblebee.city/blog/2024-was-a-year.html",
            "url": "https://bumblebee.city/blog/2024-was-a-year.html",
            "title": "2024: The Year of Cringe",
            "summary": "2024 was a year. That's really the least complicated way I can put it! It was frustrating. It was exhausting. It was fun. It was depressing. It was interesting. I don't know if life in general can possibly be smooth enough to ever be able&hellip;",
            "content_html": "<p>2024 was a year. That's really the least complicated way I can put it!</p>\n<p>It was frustrating. It was exhausting. It was fun. It was depressing. It was interesting. I don't know if life in general can possibly be smooth enough to ever be able to generalize 365 individual days into the labels of a Good Year or a Bad Year. 2024 was an okay year. I'm gonna talk about it a bit cuz that's what people do.</p>\n<p>At the end of 2023, I decided 2024 needed a theme. It was gonna be the year of cringe. I was gonna try to allow myself to be weirder and sometimes try to engage with terrible media. I think it was a fun excuse to go out of my comfort zone and try new things and do stuff I previously felt embarrassed to do.</p>\n<p>2024 began with me being off of HRT after only being on it for 3 months because I freaked out a little when I started noticing the first signs of breast growth. Having boobs is something I still don't know how I feel about but I'm not gonna get into that other than to say it took me 2 years to even consider trying HRT despite thinking about it so often because of the whole Boob Thing. I'm still on HRT now, though I haven't <em>technically </em>hit the 1 year mark due to other stuff I'll talk about later.</p>\n<p>I also decided early on in the year I was going to keep track of the notable media I engaged with throughout the year and write down my thoughts about it. This was a lot of fun, and it's gonna be something I do going forwards in the future. </p>\n<p>Then at the end of January I took \"Year of Cringe\" to it's furthest point and suddenly made a fursona and I guess became a furry??? I went to Vancoufur in March, <a href=\"https://bumblebee.city/blog/the-heros-journey-or-how-going-to-a-furry-convention-fixed-my-brain.html\">which I talked about here</a>, but to summarize it was a lot of fun and I went through a lot of personal growth getting past some anxiety in a very short period of time. I started feeling a lot more free to express myself and really forge whatever fucking identity I felt like.</p>\n<p>In April I did all sorts of weird fun stuff like going to a Hatsune Miku concert and seeing <em>The People's Joker</em> at a theatre. I finally made good friends in Vancouver thanks to a smaller furry meetup, friends I was very excited to hang out with more. And I really would have hung out with them a lot more if May didn't happen.</p>\n<p>May. Fuck May. God. I lost my housing <em>fast</em>. I'm not going to go into details of the situation cuz I don't wanna get <em>too </em>personal here (especially when it involves other people) but I made some foolish mistakes with the paperwork and those mistakes were taken advantage of, resulting in me being told I didn't have a place to live by the end of the week. I don't know if you've ever tried looking for housing but less than one week is <em>not </em>enough time to find something. I probably could have done more and maybe found a place to stay, but I was stressed as hell and didn't have <em>time </em>to figure out a plan, because if I couldn't find somewhere by the end of the week I'd be homeless. The most secure plan was my parents helping me move back in to their place.</p>\n<p>So, here I am right now no longer in Vancouver, after spending years trying to get out of this dump of a town that was slowly eating away at my soul. You know that part in <em>I Saw The TV Glow</em> where Maddy says she feels like staying in that town is going to kill her if she doesn't leave? Yeah.</p>\n<p>So being back here has really sucked. But it's been a good way to save money as Frogsong sales dwindle, I suppose.</p>\n<p>But... a lot of really good things have happened since then?</p>\n<p>I gave streaming a shot for a few months. I demoed my new game at the Vancouver Game Garden (first time showing off a demo at an in-person event!), which turned out to be a lot busier than I anticipated and a lot of people played my game and left very good feedback. I went through some very surprising stages of personal growth (again, don't want to get too personal). I made some really good and close friends. I went to a friend's wedding. I played a <em>lot </em>of new games. I made by <em>far </em>some of the coolest work I've probably ever done. Like, I'm making a little horror game where you play as a rover on a fucked up alien planet, how cool is that?? I went to Midwest Furfest (which was cool but also probably too big and don't know if I'll be back). I finally announced the new big game I've been working on with my team over the past and the response has been really positive. Based on Steam wishlists alone I have a really good feeling that this game is going to do far better than Frogsong did, which is a huge weight off my shoulders - I might actually be able to keep making games work, especially with the small games I'm releasing between the big ones. I've made a lot of progress with the development of that game. </p>\n<p>The place I'm in still sucks. All the good stuff doesn't really change that. But it was a <em>lot </em>of really good stuff?</p>\n<p>At the end of each year I also write a list of goals for the next year. It feels different from the idea of News Years resolutions to me in a way I'm not really sure how to articulate, but it's nice. I accomplished all of my goals for 2024, including a couple I wrote at the end of the list as a joke in a \"yeah like THAT will ever happen\" kind of way? </p>\n<p>I dunno. This isn't the most cohesive writing I've done but I don't usually go out of my way to make this stuff more cohesive. 2024 was a year that started off strong, quickly turned to absolute shit, and then started to get really strong again in the last few months. I'm really feeling good about this moment. I'm feeling really hopeful about 2025 in general, actually. I like the momentum that's been building.</p>\n<p>I think my theme for 2025 is gonna be Year of Cool Shit. I'm gonna make and release a bunch of cool shit. I'm gonna do a bunch of cool shit. I'm gonna watch a bunch of cool movies and play a bunch of cool games. I have a feeling it's gonna be a pretty okay year.</p>",
            "author": {
                "name": "Bee"
            },
            "tags": [
                   "year in review",
                   "life stuff"
            ],
            "date_published": "2024-12-31T01:00:00-07:00",
            "date_modified": "2024-12-31T01:40:56-07:00"
        },
        {
            "id": "https://bumblebee.city/blog/frogsong-retrospective.html",
            "url": "https://bumblebee.city/blog/frogsong-retrospective.html",
            "title": "Frogsong Retrospective",
            "summary": "I've been meaning to write a retrospective on Frogsong for a while now, but every time I tried, I got stuck. It's difficult to unpack my feelings about this game because they're very messy and weird and complicated. They shift a lot from moment to&hellip;",
            "content_html": "<p>I've been meaning to write a retrospective on Frogsong for a while now, but every time I tried, I got stuck. It's difficult to unpack my feelings about this game because they're very messy and weird and complicated. They shift a lot from moment to moment. I wanted to get this written before 2023 ended. Then I wanted to get it written for the 1 year anniversary back in June. Any time I've tried writing this, part of why I got stuck was the fact that I was writing with the intention of posting it somewhere more publicly directly connected to the game. I don't know if I can be 100% honest about how I feel in channels that are intended to market and build a community of Frogsong fans. Now that I have this blog, I'm finally sitting down and committing myself to actually reflecting on this game before the year ends, and I'm going to be honest.</p>\n<p>I'm going to reflect a little bit on the development of the game. I'm going to reflect on how it's done in the one and a half years since launch. I'm going to reflect a bit on how I've been feeling about it all. </p>\n<p>Before I go much further, I want to clarify a few things about this post:<strong> I will be casually bringing up spoilers for Frogsong.</strong> I will talk about feelings that are sometimes very negative or sad. Ideally this will end up being more bittersweet than a downer, but I'm going to bring up some not so happy things. It's going to be long and a little bit disorganized, too. There's a lot in my head I need to get out, and I'm going to be mostly writing this pretty improvisationally.</p>\n<p>We've got that all cleared up? Okay, cool. Let's get started then.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/15/Screenshot1.png\" alt=\"\" width=\"1912\" height=\"1008\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/15/responsive/Screenshot1-xs.png 640w ,https://bumblebee.city/blog/media/posts/15/responsive/Screenshot1-sm.png 768w ,https://bumblebee.city/blog/media/posts/15/responsive/Screenshot1-md.png 1024w ,https://bumblebee.city/blog/media/posts/15/responsive/Screenshot1-lg.png 1366w ,https://bumblebee.city/blog/media/posts/15/responsive/Screenshot1-xl.png 1600w ,https://bumblebee.city/blog/media/posts/15/responsive/Screenshot1-2xl.png 1920w\"></figure>\n<p>For those who are somehow here but don't know, Frogsong is a game about a little frog trying to prove they can be a hero, while a tyrannical empire is attempting to expand their empire. It was my first \"real\" game, and by that I mean it's my first game that isn't either a crappy 10 minute long RPG Maker project or a shitpost I made in like 5 hours in Clickteam Fusion. It certainly wasn't my first idea for a proper game, but it's the one that grabbed my attention long enough for me to decide to actually make it. </p>\n<p>The idea first began formulating towards the end of high school. It's really difficult to wrap my head around that fact. I feel like I've been half a dozen different people since that very first iteration. I'm 25 now. Even the game is wildly different from the initial giant sprawling BOTW-inspired open world 3D adventure I pictured (a change that is honestly for the better, in a million ways). I experimented a bit in Unreal Engine early on before deciding 2D would be way easier and better suited to my skills.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/15/ChorusModel.png\" alt=\"\" width=\"477\" height=\"409\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/15/responsive/ChorusModel-xs.png 640w ,https://bumblebee.city/blog/media/posts/15/responsive/ChorusModel-sm.png 768w ,https://bumblebee.city/blog/media/posts/15/responsive/ChorusModel-md.png 1024w ,https://bumblebee.city/blog/media/posts/15/responsive/ChorusModel-lg.png 1366w ,https://bumblebee.city/blog/media/posts/15/responsive/ChorusModel-xl.png 1600w ,https://bumblebee.city/blog/media/posts/15/responsive/ChorusModel-2xl.png 1920w\"></figure>\n<p>Frogsong was largely a vehicle for storytelling, funny character interactions, and worldbuilding. It was a hobby project. I just wanted to make a game for fun. I had this really cool idea in my head that I just had to get out there. There were features I cut really early on due to a lack of programming knowledge - for example, the bug enemies you fight were going to drop bug meat that you would cook with plants and berries and spices and stuff to make healing items. Every time I think about this I feel a pinch of regret. It would make so much sense for you to eat bug meat, and cooking food would have been so cute! It was also going to have gameplay a bit closer to the Mario &amp; Luigi series, where you can jump and there'd be a bit of platforming while navigating the world. I can easily wrap my head around how to do something like that now, but I couldn't figure it out, so I cut it very early on. This is part of why I think the main gameplay isn't very engaging. I never thought of any new mechanics to fill in the gap that left. I wasn't too pressed to make anything amazing, though. It was a hobby project and I had maybe a hundred followers on Tumblr at the time. I figured maybe like 12 people would play the game and I'd move on to my next project, and eventually get a job in the animation industry (thank fucking god I didn't go down that path though).</p>\n<p>Then, one day, while in a Discord server for a horror game jam I was joining, somebody invited me to a Discord server for \"Wholesome Games,\" saying the cute froggy game I posted about occasionally looked like a good fit for that community. It was one of those moments that just seems like a random little thing at the time, but in retrospect I can't even imagine where I would be right now if that hadn't happened.</p>\n<p>Plenty of people have already expressed their qualms with Wholesome Games. I'm not going to get into all that here. At the time, this was a small little community of people who liked cute, heartfelt games. Frogsong immediately fit in.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/15/IMG_20210106_220730.jpg\" alt=\"\" width=\"788\" height=\"564\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/15/responsive/IMG_20210106_220730-xs.jpg 640w ,https://bumblebee.city/blog/media/posts/15/responsive/IMG_20210106_220730-sm.jpg 768w ,https://bumblebee.city/blog/media/posts/15/responsive/IMG_20210106_220730-md.jpg 1024w ,https://bumblebee.city/blog/media/posts/15/responsive/IMG_20210106_220730-lg.jpg 1366w ,https://bumblebee.city/blog/media/posts/15/responsive/IMG_20210106_220730-xl.jpg 1600w ,https://bumblebee.city/blog/media/posts/15/responsive/IMG_20210106_220730-2xl.jpg 1920w\"></figure>\n<p>I tried doing a Kickstarter really early on and failed miserably. Horribly. Like, 3% of the funding goal horribly. This is largely due to the fact that I showed the game off way too early and the trailer was kind of garbage and I'm frankly impressed <em>anyone </em>tried giving me money for this thing. I dug my heels in and kept working.</p>\n<p>During the game's development, in the summer of 2019, I started feeling... weird. I started thinking about stuff. In the earliest version of Frogsong, Chorus, the player character, used they/them pronouns in a neutral way, similar to Frisk in Undertale. But as they grew into a proper character, I decided to make them non-binary. Having them be whatever the player felt like didn't feel right anymore. While writing this non-binary character struggling with self doubt and failing to earn the respect of others, I started feeling... a connection. Thoughts I had been repressing or brushing aside started bubbling up more. I did research. I talked to trans friends. I read through posts on Tumblr (note: I do not recommend this last method). After a few months of questioning and reflecting on my feelings, I told somebody \"I think I'm non-binary\" in September 2019. The game started to take on a bit of a trans lens and became a bit more personal at that point.</p>\n<p>And then COVID happened.</p>\n<p>I had made a lot of progress on the game by early 2020. The organizers of Wholesome Games wanted to put together a little community showcase to bring a bit of joy to people during the rough early pandemic days. I applied to be a part of this showcase, and wasn't surprised when I was accepted. After all, it was just a little video being put together by some friends. I eagerly waited for the showcase, and as it approached, publications started writing about it. People were talking. It dawned on everyone this was going to be much larger than anyone originally anticipated - though nobody could have predicted what it's turned into. Frogsong was only in the first Wholesome Direct for 12 seconds, but it was a moment that stands out in my mind so clearly. From that point on, my little hobby projected started gathering more and more attention. The little community around it grew to be just big enough for me to pull off another Kickstarter, launched alongside the next Wholesome Direct in 2021. I actually had funding now! </p>\n<p>I hired a couple amazing people to help out with the game. Scruffy, who makes incredible videos on YouTube about sound design and music in games, joined to help with the music. Joanna Blackhart, who's work I noticed in Ikenfell, joined to help make the game more accessible. Towards the end of development, they even helped edit the game's dialogue with me in big group meetings. Did you know the Snnikt has like 20 lines of cut dialogue??? A lot of changes were made for the better.</p>\n<p>I went through a lot during the game's development. A <em>lot</em>. I initially worked on the game from chapter to chapter, but had to momentarily put Chapter 4 on hold because my grandmother passed and the content of the chapter was far too painful to work on at the time. I started developing wrist pain that's gotten better but likely will never go away. A million other things happened. I grew and changed so much, and Frogsong did too. </p>\n<p>I went to PAX West in 2022 shortly after I quit my part time job to focus on Frogsong full time, with the intention that once the game was out I'd have money to go to animation school. It was a very last minute decision - I bought the tickets 3 days before the event. I don't know why or what it was, but I just felt this pull like I <em>had </em>to go. While there, I met and socialized with several indie game developers, some of which were huge inspirations to me and some whose work I had honestly never heard of before then but they were great people and a blast to hang out with. I met some people I vaguely knew online who I ended up growing to be friends with. I wore my Frogsong shirt... and like a dozen different people ended up recognizing it. That's when it hit me this was all really happening. People knew my game. It's one thing to see numbers on a website, but it's whole different story when complete strangers walk up to you and ask where you got that cool Frogsong shirt. </p>\n<p>People were shocked I was only 22. Most of these developers were in their early 30s. I told some developers that Frogsong had 30,000 wishlists on Steam, and they were shocked and impressed. I was told the game was going to be a huge success, especially with numbers like that. </p>\n<p>I went to PAX with the intention of seeing cool games and meeting developers who had inspired me. I left with a whirlwind of emotions, realizing that I was making a video game that was going to sell well enough to live off of for a bit. I'd have a budget to work on a new game and keep doing this. Fuck the animation industry, I didn't need to work for a random company when I could make a career off my own work! </p>\n<p>As we entered 2023, we planned on a surprise release during the Wholesome Direct 2023, hoping the marketing boost would help push the game even further. As June 10th, release day, drew closer, I was busy putting finishing touches on my wonderful little game. What started as a simple hobby project I expected a dozen people to play had grown into the start of my dream career. I don't know how I managed to sleep the night before, but that morning, the Direct began, and I finally clicked the launch button on Steam.</p>\n<p>The game was out. I had finally finished a major, multi-year project for the first time in my life, and it was going to be the start of a career where I got to keep making cool things.</p>\n<p>Based on what other developers had told me, I anticipated somewhere between 1 to 2 thousand copies to sell on day one. I went out and ate a bunch of dumplings in celebration of launch, and came home that evening to check the numbers.</p>\n<p>If it wasn't clear by my disclaimer at the start of this post, it's time for the other shoe to drop.</p>\n<p>It sold 400. Not 4000. Not 400,000. 400. For those who don't know, the best sales day of a game by far is day one, outside of weird freak scenarios like Among Us. More copies sell within the first month than any other month, and the majority of that is on day one. 400 wasn't enough. I sat there at the end of day one, the day I was supposed to be celebrating, trying to not panic. Surely it wouldn't drop off as quickly as anticipated. The surprise launch must mean people weren't ready for it and are going to get it soon! It was going to be fine!</p>\n<p>Sales didn't improve. The game is sitting below a third of the average Steam wishlist conversion rate. It currently has over 50,000 wishlists and less than 5000 copies have sold. I spent the next couple months patching bugs that slipped past me and trying to stop being too burnt out to touch the Switch port. When I finally got started on it, I had a miserable time. It took me 4 months of some of the most miserable technical work I've done, fixing bizarre bugs and dealing with weird optimizations, the whole time feeling not very hopeful about the next launch. During the miserable period between the Steam launch and the Switch launch, I grew frustrated with Frogsong. I stopped watching people stream it. I stopped wanting to think about it, but I had to. I just wanted it to be over. I struggled to market it during this period due to a mix of these feelings and likely some burn out. Making a game is exhausting. Making a game you've put your whole fucking heart and soul into and been primed to expect to sell well enough to live comfortably for a couple years only for it to not is both exhausting and demoralizing.</p>\n<p>The Switch launch was slightly worse than Steam, but I had always expected that. It was still a nice boost, and was the only reason I was able to keep going full time for a while. At this point, I just wanted to get the art book finished so I could never touch anything to do with the game again. Drawing this art to celebrate the Switch launch was... hard. It's depressing to say, but I didn't want to draw these characters.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/15/SwitchLaunchArt.png\" alt=\"\" width=\"4000\" height=\"2250\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/15/responsive/SwitchLaunchArt-xs.png 640w ,https://bumblebee.city/blog/media/posts/15/responsive/SwitchLaunchArt-sm.png 768w ,https://bumblebee.city/blog/media/posts/15/responsive/SwitchLaunchArt-md.png 1024w ,https://bumblebee.city/blog/media/posts/15/responsive/SwitchLaunchArt-lg.png 1366w ,https://bumblebee.city/blog/media/posts/15/responsive/SwitchLaunchArt-xl.png 1600w ,https://bumblebee.city/blog/media/posts/15/responsive/SwitchLaunchArt-2xl.png 1920w\"></figure>\n<p>What went wrong? Well... probably a lot.</p>\n<p>Read any indie dev's post-mortem about their game that failed and almost every time they'll blame marketing, and, yes, god, marketing is <em>hard</em>. Marketing feels bad. I just want to make video games and weird little characters. I don't want to advertise. Nobody likes ads. I feel gross trying too hard to market. So I definitely could have done better there. I didn't send out press copies of the game <em>before </em>launch because I was for some reason scared that press would leak the surprise release of this game nobody really cared about. I could have posted more. I could have sent more Steam keys to streamers. There's a lot I could have done better.</p>\n<p>But I'm not going to pretend marketing was the only problem here, or even the biggest problem here. I think the biggest issue is something I might not have been <em>able </em>to avoid due to circumstances - the gameplay isn't particularly <em>fun</em>??? Remember how I said it was primarily a vehicle for storytelling, funny character interactions, and worldbuilding? Yeah, it doesn't matter how good your story is if your gameplay is mediocre. Strip away Undertale's amazing character writing, and the battle system is still decently fun. There's neat puzzles if you're into that sort of thing. Frogsong's gameplay is walk to where the characters are and sometimes fight enemies that don't really pose much of a threat. I already outlined the reasons for this: it started as a hobby project I expected nobody to care about, and I was intimidated by my lack of programming knowledge. Really, when the game started getting attention, I probably should have redone the gameplay from the ground up, but I'm somebody who hates redoing things. I should have at the very least made the player character feel good to move around. I didn't iterate on the base systems. I barely twisted the gameplay. Being my first game, I also barely knew what good game design <em>was </em>other than basic intuition and gut feelings from having played games myself. I felt this later in development. I worried about the gameplay, but I was so far in by the time I realized something was wrong that actually making some major fixes to it would have delayed the game by another year or two. Game development is a medium that's progressively harder and/or more time consuming to make big changes to the further you get into a project. </p>\n<p>Frogsong simply wasn't a game that was very fun if you stripped away the characters. I didn't make a game people would be excited to tell their friends about. I guess that ties back into marketing a bit - word of mouth is the best form of advertising by far, and it's something you have no control of. If you aren't making something people want to recommend to their friends, you aren't going to get any word of mouth. </p>\n<p>Was the price too high? Maybe? If the price was a third of what it is, would four times as many people play it? Is that why wishlist conversion rates have been abysmal? I have no way of knowing, but I don't want to contribute to the devaluing of indie games that's occurred over the years. You'd have to sell a <em>lot </em>of copies of a $5 game to make a living for 3 or 4 years. Hell, even $15 you need to sell a shit load. $15 is still cheap as hell for a game, and I've heard if nobody's complaining about your price you're charging too low. I've chosen to take those words to heart. I'll probably be charging $20 for my next game.</p>\n<p>Lastly, the most common game marketing advice these days it to send your game to streamers. That doesn't really work when your game is a fairly linear story-based game. Why play the game when you just saw your favourite internet personality do it? You'll probably just see the same stuff again. If anything, having people stream the game very well may have actually <em>hurt </em>sales. I was more than one person say something to the effect of \"this game is awesome, I'd buy it but I watched JoCat stream it.\"</p>\n<p>I finally got the Frogsong art book out last month. I've sold 13 copies. If people hadn't already preordered it on Kickstarter it would have been a complete waste of time, financially speaking.</p>\n<p>But...</p>\n<p>Well, for starters, these numbers are <em>great </em>for a first time commercial dev, if we're being honest. Even though they were far below what I was expecting and they aren't nearly enough to keep going, most first time devs don't even recoup the $100 Steam fee.</p>\n<p>And let's ignore finances and good game design for a second. I made a fucking video game. That's something I've wanted to do since I was a little kid. This was literally a childhood dream come true. I won't lie, I told a pretty fire story too if I say so myself.</p>\n<p>I made a story and a world I'm proud of. The characters grew to be so much better than my initial vision. And again, I finished a giant project for the first time ever. I've dropped so many big projects over my life. Of <em>course </em>the gameplay is lacking, it was my first time making anything in Unity. When a game dev I respected tried the game and pointed out the flaws in the gameplay shortly before launch, these were all flaws I was aware of at that point. It felt <em>validating</em>. It meant I was <em>right about the flaws</em>. I learned and knew what I was doing now. Every flaw in Frogsong's gameplay, big and small, is something I learned from. If you were to try out my new secret game I've been working on, oh baby, you'd be able to <em>tell </em>how much I've improved. So many people told me that despite the flaws in the gameplay, the story and characters were engaging enough to stick with it. Imagine what I'm fucking capable of now that I can make an actually fun game.</p>\n<p>While working on Frogsong I met and worked with so many amazing people, including people whose work inspired me. That is <em>rare</em>. I am so incredibly lucky for this. </p>\n<p>And people <em>enjoyed </em>it even if it was nothing fantastic. Sure, it's nobody's favourite game, but it has really positive reviews on Steam. I watched somewhat large streamers play the game and saw their chat boxes explode into rainbow hearts and pogs when Chorus says they're non-binary. I've watched people on stream laugh at jokes and cry at emotional story beats. I <em>never </em>get tired of watching people jump from Bufo's funeral to the dream sequence. I never get tired of people seeing Annora's house in the Swamp of Glune. I never get tired of seeing people losing their minds over the Snnikt's fucked up form. I've also realized... I don't care that much about actually watching strangers play the game. It's so much more fulfilling to see friends play it.</p>\n<p>Not too long ago, I watched a new good friend of mine play through the whole thing. It had been a long time since I watched anyone play it, and the whole time I kept thinking to myself... <em>\"wait, this story kind of rocks???\" </em>Seeing this friend engage with the world and appreciate so many little details and laugh at the jokes and theorize about the radio tower in the background and freak out during Chorus's dream and marvel at Annora's house and ponder what the Snnikt is going to \"really\" be and be excited about traveling through the factory that had been in the background this whole time and then be hyped as hell when it turns out that the Snnikt really is just a fucking space demon or something that shoots giant lasers and meteors and slime spikes at you and cheer in the epilogue when Rana and Basalt become girlfriends... after over a year of the game being out, I remembered why I loved this game to begin with. I remembered why I wanted to make this game. I remembered that I made something special. I cried watching the credits roll.</p>\n<p>People have drawn incredible fan art. It's not much, but it is there. A couple people have even made Frogsong OCs. Some people sent me pictures of frogbuns they made after I posted the recipe for the item in the game. I'm still obsessed with <a href=\"https://x.com/theboatlord/status/1745745149823697122\">this artist who drew the minor ferryman frog NPC as a hot buff dude</a>. </p>\n<p>I think sometimes about the comment I saw once where someone said they recently realized they were non-binary and they had been thinking of a new name, and that \"Chorus\" was now a contender. I have no clue who that person is or what name they chose, but just the fact that they <em>considered </em>naming themself after a character of mine still boggles my mind.</p>\n<p>Some people have asked for a sequel or a prequel or some sort of spin off. The fact that people are asking for more is amazing. I'd be lying if I said there wasn't more I wanted to explore in the world of Frogsong. There's more stories I want to tell there, and there's even ideas and characters and settings that have bounced around in my head... but I can't promise anything right now. I'm pretty frogged out, and honestly making a direct follow up to a game that didn't do fantastically is a terrible financial decision. Maybe there will be more one day, though.</p>\n<p>It's been so so hard decoupling my feelings on how it did financially from my feelings on it as a piece of art. They don't tell you that that's going to happen when you get into this and your game doesn't blow up. Hell, I can imagine blowing up would have also led to some negative feelings of pressure and stuff. Putting your soul into a project and letting a bunch of strangers put their hands all over it is terrifying. </p>\n<p>I won't lie, it's been a difficult few months. Earlier this year, due to a rough series of circumstances (my financial situation being a major part), I had to move back to my hometown and back in with my parents after living in Vancouver for a year. It probably won't come as a surprise if you've played Frogsong to hear that I hate my hometown and feel like I don't belong here. It's a pretty right-leaning oilfield town, I'm just not the kind of person this town is meant for. It's been difficult not feeling even <em>worse </em>about the sales stuff given the fact that my life is currently notably more miserable. I don't want to be living with my parents still!!! I do really wish the game had done better, but it is what it is at this point.</p>\n<p>I've been working on a new game, and I've had mixed feelings working on it. I've been keeping it a secret for now because I'm kinda desperate to make a big splash when it's announced rather than showing off early crappy alpha footage like I did with Frogsong. I'm working towards having enough done to do a good announcement trailer and have some stuff to post for a bit. It's been hard, though, keeping it under wraps. I want so badly to talk about it. It's been so much fun learning from the above-mentioned mistakes and work on a game that's way better. It's also been difficult thinking about the future of this game. Money is running out and sales are dropping. I'll be lucky if I make $5,000 on Frogsong next year. I'm going to have to do a Kickstarter, and I'm planning on doing some smaller, faster, cheaper games alongside my multi-year games to help supplement my income. Games that are a bit more widely marketable, as gross as it feels to say. But in order for these little games and the Kickstarter to succeed, I need an audience, and I've basically had to rebuild that twice ever since Twitter turned to shit and Cohost shut down. I don't have access to as many people as I used to.</p>\n<p>Back in August, I went back to Vancouver for a bit for the first Vancouver Game Garden to show off a demo of this secret unannounced game. Reception to Frogsong's first alpha demo was pretty lukewarm, and for some reason I didn't take the right lessons away from that, so I wanted to get this game into the hands of strangers before there was even a public announcement so I could see what problems existed. To my surprise, the response was really really positive. People loved the movement and the combat. They responded well what little bits of character interactions I had. There was a puzzle at one point that was a joy to watch people slowly piece together. I loved watching people gradually figure out a strategy for fighting the boss, everyone's approach varying slightly. One of the creators of Celeste complimented the dash in the game. I've become a lot more motivated to work on this game now, knowing that people are going to like it. I really think it's going to be something special. I just need to be able to reach people.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/15/GVwve1PXwAAy6Fx.jpg\" alt=\"\" width=\"2888\" height=\"1848\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/15/responsive/GVwve1PXwAAy6Fx-xs.jpg 640w ,https://bumblebee.city/blog/media/posts/15/responsive/GVwve1PXwAAy6Fx-sm.jpg 768w ,https://bumblebee.city/blog/media/posts/15/responsive/GVwve1PXwAAy6Fx-md.jpg 1024w ,https://bumblebee.city/blog/media/posts/15/responsive/GVwve1PXwAAy6Fx-lg.jpg 1366w ,https://bumblebee.city/blog/media/posts/15/responsive/GVwve1PXwAAy6Fx-xl.jpg 1600w ,https://bumblebee.city/blog/media/posts/15/responsive/GVwve1PXwAAy6Fx-2xl.jpg 1920w\"></figure>\n<p>I haven't been able to stop worrying about money for the past 18 months. I worry about the future of my next game. I don't know how long I can keep trying to make game development work as a job.</p>\n<p>I don't have much choice but to take it one step at a time, though. I'm a million steps above where I was when I started Frogsong, and I made <em>that </em>work.</p>\n<p>I'm going to find a way to make this next one work too.</p>\n<p>Thank you for playing.</p>",
            "author": {
                "name": "Bee"
            },
            "tags": [
                   "life stuff",
                   "gamedev"
            ],
            "date_published": "2024-11-17T22:31:00-07:00",
            "date_modified": "2024-12-28T16:14:32-07:00"
        },
        {
            "id": "https://bumblebee.city/blog/the-trees-of-my-childhood-are-gone.html",
            "url": "https://bumblebee.city/blog/the-trees-of-my-childhood-are-gone.html",
            "title": "The Trees of my Childhood are Gone.",
            "summary": "There's not a lot I like about this town these days, but as a kid, I didn't mind it. The proximity to the great outdoors is always a bonus when you're a rambunctious ADHD-riddled child with equally rambunctious friends. The forests are different now, though.",
            "content_html": "<p>There's not a lot I like about this town these days, but as a kid, I didn't mind it. The proximity to the great outdoors is always a bonus when you're a rambunctious ADHD-riddled child with equally rambunctious friends. </p>\n<p>The forests are different now, though. They never stayed the same. A lot changes over the quarter of a century.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611027921272882/20241006_150726.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=c0d3613e0a99fd14a2e9bfd873bf0a9c25a0ba0ee49e889b3a3b34392bf344aa&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611027921272882/20241006_150726.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=c0d3613e0a99fd14a2e9bfd873bf0a9c25a0ba0ee49e889b3a3b34392bf344aa&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This stump was once a tree in my parents' back yard. It had wooden boards nailed to it forming a ladder that became increasingly dangerous over the years, and a tire swing once hung from a large branch. I would climb this tree all the time well into my teens. It grew too big, though. It was too close to some power lines, and it became a hazard. The city had to come and cut the tree down a few years ago. The yard feels a lot smaller now.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029930606613/20241006_141050.jpg?ex=67045d55&amp;is=67030bd5&amp;hm=e38d64a1461fb5a19d4d2a4982f5d0cf53183a86f39db780897c35bc3061ca5d&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029930606613/20241006_141050.jpg?ex=67045d55&amp;is=67030bd5&amp;hm=e38d64a1461fb5a19d4d2a4982f5d0cf53183a86f39db780897c35bc3061ca5d&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This is a park near my house. This patch of trees is only about 60 feet wide, maybe less, but a decade ago it was dense enough that the term \"forest\" still felt applicable. I would play in this forest with my siblings as a kid sometimes, or would often just walk the path that cuts through the middle. To the left, there's a spot where a tree once stood. There's no way now to know where it was if you'd never seen it. The spot is just dirt and various plants now. </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/14/treeeee.png\" alt=\"\" width=\"363\" height=\"455\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/14/responsive/treeeee-xs.png 640w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-sm.png 768w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-md.png 1024w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-lg.png 1366w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-xl.png 1600w ,https://bumblebee.city/blog/media/posts/14/responsive/treeeee-2xl.png 1920w\"></figure>\n<p>This log used to be the tree in question. There's still one final rung of a ladder once nailed to wood long ago. I have absolutely no idea who build the ladder or how long ago it was. As long as I could remember, most of the footholds were gone, with the rest far out of reach, no proper way to climb to the top.</p>\n<p>Today I finally touched the \"top\" of this tree after it was far out of my reach for so long. I didn't know how to feel about it.</p>\n<p>There's another forest at the edge of the playground of the elementary school I went to. It's probably only 20 feet from the edge of the field to the back fence. Kids weren't allowed in it, but we found ways, obviously. At winter, large snow forts would be constructed at the edge of the trees, with paths trailing into the trees hidden away from the teachers. When school wasn't in session, the forest would be explored less secretively, with no teachers around to tell us not to. There was a tiny murky pond in the forest that, in the first grade, I tried starting a rumour was inhabited with all sorts of terrible giant fish monsters despite how miniscule the body of water was. The \"Swamp of Doom,\" as I so creatively called it, has since been filled in. No monsters could possibly live there now.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029376831550/20241006_141954.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=186c74090d1eb7632997e62152b42e09e95c80bd34a2d531a04bee84682c3215&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611029376831550/20241006_141954.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=186c74090d1eb7632997e62152b42e09e95c80bd34a2d531a04bee84682c3215&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This clearing in the school forest was... well it was always a clearing of <em>some </em>scale, but it used to be a bit more secluded, and far smaller. There was a tree near the middle of this shot, with smaller trees circling around, forming a hidden little area. My best friend and I used to hang out in there when we were 12. It was a special secret spot him and I claimed as ours (though based on the number of chip bags and pop bottles that were occasionally already there, I imagine countless groups of kids had the same idea). I had my first kiss here, with him. As the forest thinned, the clearing is no longer even remotely tucked away. This clearing couldn't possibly be a place where a boy who hasn't yet realized he's not a boy could hide away and discoverer that kissing other boys isn't so bad.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028844019783/20241006_142229.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=389d5125a5305991074fde1d982fb41969d041e7253b1f8594ddd6d59394bf0c&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028844019783/20241006_142229.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=389d5125a5305991074fde1d982fb41969d041e7253b1f8594ddd6d59394bf0c&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This was once a massive field with a sparse forest along one side. There was a massive dirt trail leading downhill that my older sibling and I used to go biking down all the time as kids. We used to call the trail the Test Track for some unknown reason. Nothing was being tested there and it certainly wasn't much of a <em>track</em>. But it was the Test Track. Now it's all houses and apartment buildings and even what's probably the largest elementary school in the whole town. It was all torn down long enough ago that I only have vague impressions in my mind of what the Test Track used to look like. It's almost hard to imagine it was even there at all.</p>\n<figure class=\"shrinkToFit\"><img loading=\"lazy\"  src=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028428918844/20241006_144205.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=22dbe3c7bc992315f247e6feb59d1ec88a74a3fabb59dfe083e16e5ced318abe&amp;\" alt=\"https://cdn.discordapp.com/attachments/592449275074576425/1292611028428918844/20241006_144205.jpg?ex=67045d54&amp;is=67030bd4&amp;hm=22dbe3c7bc992315f247e6feb59d1ec88a74a3fabb59dfe083e16e5ced318abe&amp;\" width=\"1920\" height=\"887\" data-is-external-image=\"true\"></figure>\n<p>This paved path is another place we would bike. Years ago, the path was just through a forest. Much like the Test Track, there was a rapid period of houses being built here. One side is still forest, with the train tracks trailing just past the trees. The other side of the path is a slightly uncomfortable feeling view into a bunch of strangers' back yards, or even right into their house through big sliding glass doors. It manages to be both quieter and louder than it used to be at the same time. Less leaves rustling in the wind, or birds chirping, or unknown small animals sneaking through the bushes. It's a lot more empty sounding, aside from the sounds of trucks going by or people having conversations with the windows open or laughing in their back yards. Don't get me wrong, most of these new sounds certainly aren't bad. I really like hearing people obviously having fun. It's just different. It isn't what it once was.</p>\n<p>Some of these changes are due to land development. Most of them are just due to time. The trees I grew up with are gone. They were there, they were a part of my childhood, and they were alive. These old, towering organisms enriched my life with no way to possibly be aware of it. Now they're dead. </p>\n<p>Everything changes. Nothing stays the same. Everything around you is different from how it was last week. By the time you notice it, though, what you once knew is gone.</p>\n<p>We lose everything eventually. Even trees.</p>\n<p>Take some time to focus on and appreciate what's here right now.</p>",
            "author": {
                "name": "Bee"
            },
            "tags": [
            ],
            "date_published": "2024-10-06T16:52:00-07:00",
            "date_modified": "2024-10-06T16:55:34-07:00"
        },
        {
            "id": "https://bumblebee.city/blog/eggbugs-obituary-goodbye-cohost.html",
            "url": "https://bumblebee.city/blog/eggbugs-obituary-goodbye-cohost.html",
            "title": "Eggbug’s Obituary: Goodbye, Cohost",
            "summary": "As most people reading this probably know, on October 1st, Cohost is shutting down. This website meant a lot to me, as it did for a lot of people. I need to write about it and get my thoughts out. I won’t lie, I spent&hellip;",
            "content_html": "<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bumblebee.city/blog/media/posts/3/eggbug.png\" alt=\"\" width=\"440\" height=\"440\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://bumblebee.city/blog/media/posts/3/responsive/eggbug-xs.png 640w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-sm.png 768w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-md.png 1024w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-lg.png 1366w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-xl.png 1600w ,https://bumblebee.city/blog/media/posts/3/responsive/eggbug-2xl.png 1920w\"></figure>\n<p><span style=\"font-weight: 400;\">As most people reading this probably know, on October 1st, Cohost is shutting down. This website meant a lot to me, as it did for a lot of people. I need to write about it and get my thoughts out.</span></p>\n<p><span style=\"font-weight: 400;\">I won’t lie, I spent a good portion of last night sitting in bed crying. Being an artist on the internet is hard, and it keeps getting harder every month. Doubly so if you’re like me and made the bad choice of trying to make a living off of it. Cohost felt like a bit of a reprieve from that. It was an incredibly special community.</span></p>\n<p><span style=\"font-weight: 400;\">As I <a href=\"https://bumblebee.city/blog/the-heros-journey-or-how-going-to-a-furry-convention-fixed-my-brain.html\" target=\"_blank\" rel=\"noopener noreferrer\">wrote before</a>, I’ve been struggling with trying to be less scared of what other people think of me. I’ve been trying to allow myself to be more messy, more visibly queer, more open to being whatever I am. Cohost played a big role in that. It helped me realize I HATED the way I was presenting myself online. Being clean and professional and perfect is so boring. I don’t want to limit my online presence to just being an indie game developer. It’s a big part of who I am, but not the only part. I don’t want to be just one thing. Cohost was a space where I could talk about random things like furry conventions or my favourite games or post a bunch of weird pictures of chevrotains. I didn’t feel the need to uphold some reputation. I could just hang out in a way I didn’t feel comfortable doing on sites like Twitter.</span></p>\n<p><span style=\"font-weight: 400;\">The engagement that came from the site is incredible too. I had a modest amount of engagement on Cohost despite not having much interesting to post - the most interesting thing I’ve been working on over the past year is a game that’s too early to announce. I was so excited to finally have something cool and fun to share by the end of the year, and I’m gutted by the fact that there’s not enough time left in the site for me to share this game with the wonderful community Cohost has. I loved the site, but never got the chance to use it to the fullest. But even still, people seemed SIGNIFICANTLY more interested in anything I had to post there than anywhere else. I posted about me going to the Vancouver Game Garden last month all over Twitter, and one person from my modest following on Twitter showed up to play my demo. 3 people who weren’t even following me on Cohost showed up, and then two more showed up because they saw a post made by one of those first 3 recommending people stop by to play my demo specifically. People <em>love </em>things on Cohost in a way no other social media today has. It fills me with dread knowing I’m going to be going back to sites where most people following me really don’t care all that much about my work.</span></p>\n<p><span style=\"font-weight: 400;\">Still, I have hope a website like Cohost will appear again. Maybe it’s foolish to think that, and maybe people will feel too burned from the death of Cohost to want to use it. But I’ve never seen such an emotional, earnest, and deeply mournful response to the loss of a website before in my life. Cohost was needed by so many people. I believe the Cohost staff aren’t the only ones capable of making such a site. </span></p>\n<p><span style=\"font-weight: 400;\">Cohost showed the path to a better internet. Comment more. Curate your social media feeds more deeply. Step away from websites whenever you want. Engage with your communities. My relationship with social media has improved vastly. I’m not going to have as much fun on Twitter or Bluesky as I did on Cohost, and I think that just means I’m going to use them less. If I see something on Twitter that pisses me off, I’ll simply close the website for the day. I’ve seen many people post that Cohost has led them to do the same. The impact Cohost had on those who loved it is deep and positive and will last for a very long time.</span></p>\n<p><span style=\"font-weight: 400;\">A better internet is possible. </span></p>\n<p><span style=\"font-weight: 400;\">Thank you all for the amazing times.</span></p>\n<p><span style=\"font-weight: 400;\">Goodnight, eggbug. One day we will meet again.</span></p>",
            "author": {
                "name": "Bee"
            },
            "tags": [
            ],
            "date_published": "2024-09-10T21:40:42-07:00",
            "date_modified": "2024-09-30T14:38:12-07:00"
        },
        {
            "id": "https://bumblebee.city/blog/the-heros-journey-or-how-going-to-a-furry-convention-fixed-my-brain.html",
            "url": "https://bumblebee.city/blog/the-heros-journey-or-how-going-to-a-furry-convention-fixed-my-brain.html",
            "title": "The Hero’s Journey, or: How Going to a Furry Convention Fixed My Brain",
            "summary": "I’m not entirely sure how long I’ve been this way, but recently I’ve realized I’m someone who is way too scared of what other people think of me, including strangers. This is not an ideal trait to have when you’re someone who’s visibly queer, nor&hellip;",
            "content_html": "<div class=\"co-prose prose my-4 overflow-hidden break-words px-3\">\n<p>I’m not entirely sure how long I’ve been this way, but recently I’ve realized I’m someone who is way too scared of what other people think of me, including strangers. This is not an ideal trait to have when you’re someone who’s visibly queer, nor is it an ideal trait to have when you’re someone who puts very personal art out onto the internet for a living! This year, I’ve been trying to focus on getting better at not worrying about this and just exist. Easier said than done, of course.</p>\n<p>Back in January, thanks to encouragement from my friend Strade (if you’re reading this hii), I made a fursona! I got a lot more invested in it than I expected I would, and spent several hours designing them. I even almost forgot eat that night because I was so focused. If you haven’t seen them yet, here they are!</p>\n<p><img loading=\"lazy\" src=\"http://bumblebee.city/fennel.png\" data-is-external-image=\"true\"></p>\n<p>Their name is Fennel and they’re a dog/sheep combo. It was a really fun form of self expression! Of course, having a fursona didn’t make me a furry or anything. It was just for fun. Of course.</p>\n<p>And then two days later I registered for Vancoufur, a local furry convention.</p>\n<p>In the coming weeks, I grew more and more excited. I’ve been really struggling to make friends and meet people ever since I moved here a year ago, and I was hoping this would be a good chance to socialize with other terminally online queer weirdos.</p>\n<p>Once I got there, it took a while for it to really click for me. I’m not exactly new to cons - I’ve been to the Calgary Fan Expo twice, the Vancouver Fan Expo once, and PAX West twice. Vancoufur was nothing like these. There weren’t a lot of booths, and there weren’t really that many panels going on at a time either. What was I supposed to do between events? Just sit around doing nothing? Don’t get me wrong, I was already having a lot of fun, but I wasn’t really sure why the con lasted for so long if there were so few booths and so few events.</p>\n<p>On the second evening, I was bored and it was several hours until my next panel, so I wandered around and ended up in a big dance/rave area. Dances aren’t really my thing, but I figured it’d be something different to at least look at. Swaying back and forth awkwardly at the back of the room like I did at every dance in high school, I watched all these people dancing and having fun. People wearing fursuits, or cosplays, or maid dresses, or even just regular casual clothes, just dancing and enjoying being themselves. That’s when it hit me, what separated this from any other con I had been to. Standard cons are a bunch of booths and panels surrounding a shared interest. Furry cons are high energy, wholehearted celebrations of being a complete fucking weirdo, and I am so fucking on board with that.</p>\n<p>After that point, I enjoyed the convention a lot more. I allowed myself to go all in and be weird and earnest and cringe! I talked to a lot of people! I joined the annoying chorus of YIPPIEs that would sprout up in the crowd every other hour! I tried on this big waggy tail thing at the Dealer’s Den! It was a lot of fun! Turns out being yourself and allowing yourself to have fun is… well, fun. Who knew! I never realized how much I needed something like this.</p>\n<p>By the time the convention was over, I was exhausted and ready to sleep for a hundred years, but I knew I was fundamentally changed. I’m not the same person I was a week ago. I can already feel in my brain that the little evil leech that’s constantly screeching about how other people think I’m weird has started shrivelling up. It has no more food now that my response to “<i>other people think you’re fucking weird</i>” is usually an indifferent shrug. My anxiety hasn’t disappeared over night, of course, but it’s made an almost supernatural amount of progress over the course of a single weekend.</p>\n<p>Over the past week, I’ve cared a lot less about whether strangers care about my pastel pink dyed hair or the fact that I’m wearing a skirt but have a clearly visible beard shadow. I’ve found myself ever so slightly dancing along a little bit to the music playing on the grocery store radio. I’ve felt a lot more free, and I’m having more little moments of fun in day to day life. It’s been less than a week since the con ended, and I hope this energy continues throughout the year and into the future.</p>\n<p>I have already registered for next year’s con and will probably be going to another, smaller one in November. Yippie!</p>\n<p> </p>\n<img loading=\"lazy\" src=\"http://bumblebee.city/herosjourney.png\" data-is-external-image=\"true\"></div>",
            "author": {
                "name": "Bee"
            },
            "tags": [
                   "life stuff",
                   "furry"
            ],
            "date_published": "2024-03-20T15:54:00-07:00",
            "date_modified": "2024-09-19T01:58:18-07:00"
        }
    ]
}
